{
  "backend/main.mo": "Defines enums and types for clients, tasks, team members, and status categories along with comparison helpers for ordering.",
  "feature_evidence.json": "Lists feature evidence records mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and behavior of various frontend components and pages.",
  "frontend/index.css": "Defines Tailwind CSS base layers and custom theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the main React app and setting basic metadata and favicon.",
  "frontend/src/App.tsx": "Main app component handling authentication, public search routing, profile setup flow, and layout rendering.",
  "frontend/src/components/AddClientDialog.tsx": "Dialog form allowing users to create a new client with validation and enum‑based field selection.",
  "frontend/src/components/AddTeamMemberDialog.tsx": "Dialog for adding team members with principal ID validation and error handling.",
  "frontend/src/components/BulkEditClientsDialog.tsx": "Dialog for bulk editing client fields like status, task category, and recurring options, applying updates via useUpdateClients.",
  "frontend/src/components/BulkEditTasksDialog.tsx": "Dialog allowing bulk task updates including status, comments, task type, assignments, dates, billing, and payment fields with validation.",
  "frontend/src/components/BulkImportDialog.tsx": "Handles bulk importing clients from CSV or Excel, parsing fields, validating data, and previewing before submission.",
  "frontend/src/components/BulkImportTasksDialog.tsx": "Processes CSV or Excel task imports, validating task attributes and matching clients and team members before preview and upload.",
  "frontend/src/components/BulkImportTeamMembersDialog.tsx": "Imports team members from Excel by parsing rows, generating principals, validating entries, and submitting them in bulk.",
  "frontend/src/components/ClientTable.tsx": "Renders a client table with selection, bulk actions, and dialogs for editing, viewing tasks, adding tasks, and deleting clients. Manages client selection state and integrates admin permissions and delete mutations.",
  "frontend/src/components/CreateTaskDialog.tsx": "Provides a dialog to create a new task with fields for client, assignee, dates, billing, and comments. Handles validation, timestamp conversion, and submission via createTask mutation.",
  "frontend/src/components/DueDateDetailModal.tsx": "Displays a modal listing tasks due for a selected day type with sortable columns. Retrieves data via query hook and formats status, payment status, and dates.",
  "frontend/src/components/EditClientDialog.tsx": "Shows a dialog for editing client information including contact details, status, and categories. Syncs form state with client props and submits updates through updateClient mutation.",
  "frontend/src/components/EditTaskDialog.tsx": "Provides a dialog to edit an existing task with fields for status, dates, billing, and assignment. Converts timestamps, loads related data, and updates tasks via updateTask mutation.",
  "frontend/src/components/MainLayout.tsx": "Provides the main app layout with a sidebar, navigation, page switching, and logout handling using user profile and admin status queries.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their name during initial profile setup.",
  "frontend/src/components/public-search/TeamMemberTasksTable.tsx": "React table component that displays, sorts, selects, and exports team-member-assigned public tasks.",
  "frontend/src/components/RevenueDetailModal.tsx": "Displays sortable revenue details in a modal based on the selected revenue card type, using backend query data.",
  "frontend/src/components/SearchableAssigneeSelect.tsx": "A searchable dropdown for selecting a team member, with filtering and selection logic.",
  "frontend/src/components/TaskList.tsx": "Renders tasks in a sortable, filterable table with editing, commenting, bulk actions, and admin‑aware controls.",
  "frontend/src/components/ViewClientTasksDialog.tsx": "Modal that lists tasks for a specific client with status and type labels, using fetched task data.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance tied to Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook handling Internet Identity login, stored identities, and status management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend calls for profiles, public search, admin checks, and other data.",
  "frontend/src/index.css": "TailwindCSS setup defining light/dark theme variables and base styles.",
  "frontend/src/lib/excelTemplates.ts": "Utility functions for parsing CSV, generating client/task import templates, and exporting task data.",
  "frontend/src/main.tsx": "Application entry point initializing React Query, Internet Identity provider, and rendering the app.",
  "frontend/src/pages/ClientsPage.tsx": "Displays client list with search, admin actions for adding and importing clients, and shows dialogs for creation and bulk import.",
  "frontend/src/pages/DashboardPage.tsx": "Aggregates client, task, team, and revenue data into dashboard cards with filters, task breakdowns, and export functionality.",
  "frontend/src/pages/LoginPage.tsx": "Renders a branded login screen enabling authentication via Internet Identity and navigation to public search.",
  "frontend/src/pages/PublicSearchPage.tsx": "Provides public searching of team members, clients, and tasks with debounced search, sorting, collapsible sections, and Excel export.",
  "frontend/src/pages/TasksPage.tsx": "Displays filterable task lists with date search, bulk import, task creation, and Excel export options.",
  "frontend/src/pages/TeamPage.tsx": "Shows team member list with admin options to add or bulk‑import members and download a template.",
  "frontend/src/pages/ToDoPage.tsx": "React page for viewing, filtering, creating, editing, deleting, and exporting user to‑do items with dialogs and date handling.",
  "frontend/src/utils/formatters.ts": "Utility helpers for formatting dates and optional text values with placeholders.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, shadows, animations, and container settings for the app.",
  "project_state.json": "Project metadata describing UI redesign goals, feature requests, issues, and current app state for planning."
}