{
  "backend/main.mo": "Defines enums, types, and comparison helpers for clients, tasks, team members, and todos, forming the core data model for the backend actor.",
  "feature_evidence.json": "Contains feature evidence records linking feature requirements to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists high-level summaries of multiple frontend components, hooks, and pages for reference.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend CSS.",
  "frontend/index.html": "Basic HTML entry point that loads the React application into the root div.",
  "frontend/src/App.tsx": "Main React application component controlling authentication flow, public search handling, and default dark theme setup.",
  "frontend/src/components/AddClientDialog.tsx": "Dialog form for adding a new client with fields for identifiers, status, categories, and recurring settings.",
  "frontend/src/components/AddTeamMemberDialog.tsx": "Dialog to create a team member by entering a name and principal ID with validation and error handling.",
  "frontend/src/components/BulkEditClientsDialog.tsx": "Dialog for bulk editing client fields such as status, task category, and recurring settings, then submitting updates via a mutation.",
  "frontend/src/components/BulkEditTasksDialog.tsx": "Dialog enabling batch updates to multiple task attributes, including status, comments, assignment, dates, billing, and captains, with validation and mutation submission.",
  "frontend/src/components/BulkImportDialog.tsx": "Dialog for importing clients from CSV or Excel, parsing data into preview entries and submitting them through a bulk‑import mutation.",
  "frontend/src/components/BulkImportTasksDialog.tsx": "Dialog handling Excel-based task import with preview, validation of fields, and construction of task objects for bulk upload.",
  "frontend/src/components/BulkImportTeamMembersDialog.tsx": "Dialog for uploading and parsing Excel files to create new team members, generating principals and submitting them via bulk import.",
  "frontend/src/components/CaptainsMultiSelect.tsx": "Provides a searchable popover-based multi-select UI for choosing multiple team members as captains, showing selected items as removable badges.",
  "frontend/src/components/ClientTable.tsx": "Renders a client list table with admin-only bulk actions, per-client edit/view/delete options, and selection state management.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating tasks, handling form inputs, validation, date conversions, captain selection, and submission via createTask API.",
  "frontend/src/components/DueDateDetailModal.tsx": "Displays tasks filtered by due-date type with status badges and supports exporting the listed tasks to Excel.",
  "frontend/src/components/EditClientDialog.tsx": "Dialog for editing client details with form bindings, validation, and update submission via updateClient API.",
  "frontend/src/components/EditTaskDialog.tsx": "Dialog component for editing task details, handling form state, field updates, and date conversions, and submitting updates via useUpdateTask.",
  "frontend/src/components/MainLayout.tsx": "Main application layout with a sidebar, navigation, and page routing for dashboard, clients, tasks, todo, and team pages.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and save their profile using useSaveCallerUserProfile.",
  "frontend/src/components/public-search/TeamMemberTasksTable.tsx": "Sortable, selectable tasks table for public search showing team member assignments, statuses, and export options.",
  "frontend/src/components/RevenueDetailModal.tsx": "Modal displaying detailed revenue data with sorting, payment status indicators, and content fetched via useGetRevenueModalData.",
  "frontend/src/components/SearchableAssigneeSelect.tsx": "Popover-based searchable dropdown for selecting a team member by filtering and choosing from a list.",
  "frontend/src/components/TaskList.tsx": "Task table with sorting, selection, comment editing, task deletion, and dialogs for editing tasks and viewing client tasks.",
  "frontend/src/components/ViewClientTasksDialog.tsx": "Dialog component that displays a table of tasks filtered by client with status, type, due date, and payment badges.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity handling login, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, admin checks, and public search endpoints.",
  "frontend/src/index.css": "Tailwind CSS base styles with extensive light/dark theme tokens and color system definitions.",
  "frontend/src/lib/excelTemplates.ts": "Provides CSV parsing and functions to generate and download client/task import templates.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ClientsPage.tsx": "Displays searchable client list with admin actions for adding and bulk importing clients.",
  "frontend/src/pages/DashboardPage.tsx": "Renders dashboard metrics for clients, tasks, and revenue with export and filtering options.",
  "frontend/src/pages/LoginPage.tsx": "Presents login UI using Internet Identity with navigation to public search.",
  "frontend/src/pages/PublicSearchPage.tsx": "Enables public search of team members, clients, and tasks with sorting and export features.",
  "frontend/src/pages/TasksPage.tsx": "Task management page with filtering, date search, bulk actions, and export/import support.",
  "frontend/src/pages/TeamPage.tsx": "Displays team members and provides admin tools to add or bulk import new members.",
  "frontend/src/pages/ToDoPage.tsx": "Manages user to-dos with add, edit, delete, filter, and export features.",
  "frontend/src/utils/formatters.ts": "Formatting helpers for dates, placeholders, and optional text fields.",
  "frontend/src/utils/taskStatus.ts": "Defines task status order, labels, options, and comparison logic for sorting.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and managing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, shadows, typography, and container settings.",
  "project_state.json": "Tracks the project’s current dark blue theming initiative, listing existing theme-related features and a pending new feature request. Contains project metadata, state versioning, and empty notes/issue sections."
}