{
  "kind": "build_request",
  "title": "Apply dark blue theme across the UI (deep blue accents, darker backgrounds)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the app theme tokens to a dark blue palette so dark mode uses deep blue accents and darker blue-tinted backgrounds while maintaining readable contrast for text and UI surfaces (cards, popovers, dialogs, sidebar). Apply the changes via the existing CSS variable tokens used by Tailwind (e.g., in frontend/src/index.css) so the updated palette propagates across all pages and components consistently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Dark blue theme (deep blue, darker backgrounds)"
        ]
      },
      "acceptanceCriteria": [
        "In dark mode, the main app background and key surfaces (cards/popovers/dialogs/sidebar) render with dark blue-tinted backgrounds rather than neutral gray/black.",
        "Primary/accent styling (buttons, active nav item, gradients) uses a deep blue tone consistent across Login and MainLayout.",
        "Text and icons remain readable with sufficient contrast on all updated backgrounds, including within dialogs and popovers (no transparency-induced readability issues)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make dark mode the default theme used by the app ThemeProvider so users see the dark blue theme by default on first load (including authenticated app routes and the public search route).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Dark blue theme (deep blue, darker backgrounds)"
        ]
      },
      "acceptanceCriteria": [
        "On first load in a new session, the UI renders in dark mode without requiring the user to change OS/system theme.",
        "The dark blue theme is applied consistently on Login, MainLayout, and Public Search experiences."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (immutable paths).",
    "Preserve the existing behavior that forces opaque backgrounds for dialogs/popovers/select dropdowns (do not reintroduce transparency issues)."
  ],
  "nonGoals": [
    "Adding a user-facing theme toggle UI.",
    "Changing backend logic or data models."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}