{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Default dark blue theme via Tailwind CSS variables and ThemeProvider defaults",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update dark-mode CSS variable theme tokens to a deep dark-blue palette and keep floating surfaces opaque across the UI.",
      "acceptanceCriteria": [
        "In dark mode, the main app background and key surfaces (cards/popovers/dialogs/sidebar) render with dark blue-tinted backgrounds rather than neutral gray/black.",
        "Primary/accent styling (buttons, active nav item, gradients) uses a deep blue tone consistent across Login and MainLayout.",
        "Text and icons remain readable with sufficient contrast on all updated backgrounds, including within dialogs and popovers (no transparency-induced readability issues)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the existing CSS variable tokens under the `.dark` selector (and any necessary supporting tokens) to a cohesive dark-blue palette (background/card/popover/sidebar + primary/secondary/accent/ring/border) so Tailwind + shadcn/ui token-based styling propagates consistently across all pages and components. Verify the shadcn-ui component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Preserve and validate the 'Force opaque backgrounds for all floating surfaces' behavior by ensuring the override rules use the same color function as the Tailwind token mapping (e.g., use `oklch(var(--popover))` / `oklch(var(--popover-foreground))` instead of `hsl(...)`) while keeping `opacity: 1` and no backdrop transparency regressions for dialogs/popovers/select/dropdowns."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make dark mode the default theme on first load across authenticated routes and the public search route.",
      "acceptanceCriteria": [
        "On first load in a new session, the UI renders in dark mode without requiring the user to change OS/system theme.",
        "The dark blue theme is applied consistently on Login, MainLayout, and Public Search experiences."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the existing `ThemeProvider` configuration so the app defaults to dark mode on first load (including the public search and authenticated flows), while keeping class-based dark mode (`attribute=\"class\"`) and removing reliance on system theme (e.g., set `defaultTheme=\"dark\"` and disable system theming)."
        }
      ]
    }
  ]
}