{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Modernized, cohesive UI theme refresh (global tokens, shell, Dashboard + Login)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Apply a cohesive modern theme across all pages by updating global CSS theme tokens and aligning spacing/typography/shadows/interactive states using existing Tailwind + shadcn/ui composition (no ui component edits).",
      "acceptanceCriteria": [
        "A cohesive visual theme is applied across the entire app (no page looks like an older style compared to others).",
        "Global theme tokens (CSS variables) are updated in frontend/src/index.css for both light and dark mode.",
        "Primary/secondary/accent colors, borders, muted text, and background colors look intentionally designed (not default) and remain readable with sufficient contrast.",
        "Cards, tables, and dialogs use a consistent radius, shadow, and padding system.",
        "Buttons, inputs, selects, and tabs have improved hover/focus styles consistent with the new theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Refresh light/dark CSS variable tokens (background/foreground/card/border/muted/accent/primary/ring/radius) and base element defaults to achieve a more premium, consistent look across the app (e.g., refined contrast, softer surfaces, better focus ring)."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Align Tailwind theme extensions (e.g., shadows, borderRadius, ring/alpha usage) with the updated CSS tokens so cards/dialogs/buttons/inputs consistently render modern depth and hover/focus states across pages."
        },
        {
          "path": "frontend/src/pages/ClientsPage.tsx",
          "operation": "modify",
          "description": "Adjust page-level composition (headers, cards, and search section) to match the updated theme: consistent spacing, typography hierarchy, and modern hover/focus affordances via className/props only (do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Update page-level layout spacing and section styling (header, filter card nesting, tabs/select/input wrappers) to match the new theme with consistent padding, shadows, and interactive states via className/props only (do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ToDoPage.tsx",
          "operation": "modify",
          "description": "Refine To-Do page surface styling (list rows/cards, header hierarchy, buttons) so it matches the modern theme (consistent radius/shadow/padding and hover/focus states) via className/props only (do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TeamPage.tsx",
          "operation": "modify",
          "description": "Update Team page card grid and empty state styling to align with the refreshed theme (typography, spacing, subtle depth) via className/props only (do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PublicSearchPage.tsx",
          "operation": "modify",
          "description": "Align Public Search page styling (inputs, results sections/tables/cards) with the new global theme tokens and interaction states using className/props only (do not edit frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Refresh MainLayout shell styling (sidebar/header/footer) for a premium look with clearer navigation states while keeping responsiveness and toggle behavior intact.",
      "acceptanceCriteria": [
        "Sidebar and header styling in frontend/src/components/MainLayout.tsx are updated to match the new theme (backgrounds, borders, spacing, and typography).",
        "Active navigation item is visually distinct in a stylish way (not just a flat color block), and hover states are clearly visible.",
        "Layout remains responsive: sidebar toggle works and the app remains usable on smaller screens.",
        "Footer styling matches the updated theme and does not visually clash with the main content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MainLayout.tsx",
          "operation": "modify",
          "description": "Redesign sidebar/header/footer presentation using the updated theme tokens: improve spacing, typography, and add modern navigation affordances (active item treatment with subtle depth/ring/gradient, clearer hover states), while preserving existing sidebar toggle responsiveness and page switching logic. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Modernize Dashboard and Login page styling to reflect the new theme (hierarchy, icons, subtle depth/background treatments) without changing any existing behavior.",
      "acceptanceCriteria": [
        "Dashboard cards/sections (frontend/src/pages/DashboardPage.tsx) look more modern through improved spacing, typography scale, and consistent icon/badge styling.",
        "Login page (frontend/src/pages/LoginPage.tsx) styling is aligned with the new theme and feels premium (background, card styling, and typography).",
        "No functional behavior changes: all existing buttons/flows still work as before (login, navigation, export buttons, etc.)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Refine Dashboard visual hierarchy and card styling (consistent icon containers, badge treatments, spacing scale, section headers, subtle gradients/shadows) by composing existing shadcn/ui components via className/props only (no functionality changes, no ui component edits). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Update Login page to feel more premium (background treatment, hero + login card depth, typography hierarchy, button/outline styling) using className/props only while preserving login/public-search behaviors. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}